In [1]:
import pandas as pd

In [ ]:
#abrir parquet

df_transacciones = pd.read_parquet('transacciones.parquet')
df_transacciones.head()

     customer_id  product_id  order_id purchase_date     items
124        61353       61364    411145    2024-04-27 -0.333333
127        61899        1370    411156    2024-04-27  3.666667
344       154077       30500    417911    2024-04-29  2.333333
349       164337       56714    418100    2024-04-29 -2.333333
354       172056       61672    407162    2024-04-26  1.000000

In [6]:
#conteo na en purchase_date
df['purchase_date'].isna().sum()

#numero filas
len(df)

254936

In [7]:
df_clientes = pd.read_parquet('clientes.parquet')
df_clientes.head()

,customer_id,region_id,zone_id,customer_type,Y,X,num_deliver_per_week,num_visit_per_week
10705,256017,80,5148,ABARROTES,-46.474800,-108.045140,1,1
10706,255780,80,5148,ABARROTES,-46.520282,-107.961052,1,1
10707,254655,80,5148,ABARROTES,-46.537640,-107.909280,1,1
10708,254445,80,5148,ABARROTES,-46.543526,-107.917954,2,1
10709,254403,80,5148,ABARROTES,-46.540856,-107.905792,3,1